Pandas provides various facilities for easily combining together Series or DataFrame with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

In [22]:
import pandas as pd

left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (left)
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

### Merge two dataframes

`Merge()` is a function used to combine two or more data frames on the basis of a common column or index. It is similar to SQL Join operation and can perform left, right, inner or outer join. Merge() can join data frames based on one or more columns. The syntax for merge() function is as follows:

In [3]:
dfmerged = pd.merge(left,right,on='id')
dfmerged

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [4]:
dfmerged = pd.merge(left,right,on=['id','subject_id'])
dfmerged

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

| Merge Method |  SQL Equivalent  |         Description        |
|:------------:|:----------------:|:--------------------------:|
|     left     |  LEFT OUTER JOIN | Use keys from left object  |
|     right    | RIGHT OUTER JOIN | Use keys from right object |
|     outer    |  FULL OUTER JOIN | Use union of keys          |
|     inner    |    INNER JOIN    | Use intersection of keys   |

In [ ]:
#left join
dfmerged = pd.merge(left, right, on='subject_id', how='left')

dfmerged = pd.merge(left, right, on='subject_id', how='left')

#### Inner jouin
Joining will be performed on index. Join operation honors the object on which it is called. So, a.join(b) is not equal to b.join(a).

In [5]:
dfmerged = pd.merge(left, right, on='subject_id', how='inner')
print(dfmerged)

dfmerged = pd.merge(right, left, on='subject_id', how='inner')
print(dfmerged)

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty
   id_x Name_x subject_id  id_y  Name_y
0     1  Billy       sub2     2     Amy
1     2  Brian       sub4     3   Allen
2     4  Bryce       sub6     4   Alice
3     5  Betty       sub5     5  Ayoung

#### Left join

In [ ]:
#left join
dfmerged = pd.merge(left, right, on='subject_id', how='left')
dfmerged

#### Right join

In [ ]:
#left join
dfmerged = pd.merge(left, right, on='subject_id', how='right')
dfmerged

#### Outer join

In [ ]:
#outer join
dfmerged = pd.merge(left, right, on='subject_id', how='outer')
dfmerged

In [26]:
trades = pd.DataFrame(
    {
        "time": pd.to_datetime(
            [
                "20160525 13:30:00.023",
                "20160525 13:30:00.038",
                "20160525 13:30:00.048",
                "20160525 13:30:00.048",
                "20160525 13:30:00.048",
            ]
        ),
        "ticker": ["MSFT", "MSFT", "GOOG", "GOOG", "AAPL"],
        "price": [51.95, 51.95, 720.77, 720.92, 98.00],
        "quantity": [75, 155, 100, 100, 100],
    },
    columns=["time", "ticker", "price", "quantity"],
)
 

quotes = pd.DataFrame(
    {
        "time": pd.to_datetime(
        [
                "20160525 13:30:00.023",
                "20160525 13:30:00.023",
                "20160525 13:30:00.030",
                "20160525 13:30:00.041",
                "20160525 13:30:00.048",
                "20160525 13:30:00.049",
                "20160525 13:30:00.072",
                "20160525 13:30:00.075",
            ]
        ),
        "ticker": ["GOOG", "MSFT", "MSFT", "MSFT", "GOOG", "AAPL", "GOOG", "MSFT"],
        "bid": [720.50, 51.95, 51.97, 51.99, 720.50, 97.99, 720.50, 52.01],
        "ask": [720.93, 51.96, 51.98, 52.00, 720.93, 98.01, 720.88, 52.03],
    },
    columns=["time", "ticker", "bid", "ask"],
)
pd.merge_asof(trades, quotes, on="time", by="ticker")

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155   51.97   51.98
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN

#### Concat

The `concat() function (in the main pandas namespace) does all of the heavy lifting of performing concatenation operations along an axis while performing optional set logic (union or intersection) of the indexes (if any) on the other axes.

In [9]:
result = pd.concat([left, right])
print(result)

result = pd.concat([left, right], keys =["a", "b"], axis = 1, ignore_index=True)
print (result)

result = pd.concat([left, right], keys =["a", "b"], axis = 1)
print (result)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
0   1   Billy       sub2
1   2   Brian       sub4
2   3    Bran       sub3
3   4   Bryce       sub6
4   5   Betty       sub5
   0       1     2  3      4     5
0  1    Alex  sub1  1  Billy  sub2
1  2     Amy  sub2  2  Brian  sub4
2  3   Allen  sub4  3   Bran  sub3
3  4   Alice  sub6  4  Bryce  sub6
4  5  Ayoung  sub5  5  Betty  sub5
   a                     b
  id    Name subject_id id   Name subject_id
0  1    Alex       sub1  1  Billy       sub2
1  2     Amy       sub2  2  Brian       sub4
2  3   Allen       sub4  3   Bran       sub3
3  4   Alice       sub6  4  Bryce       sub6
4  5  Ayoung       sub5  5  Betty       sub5

In [16]:
result = pd.concat([left, right], axis=1)
result

   id    Name subject_id  id   Name subject_id
0   1    Alex       sub1   1  Billy       sub2
1   2     Amy       sub2   2  Brian       sub4
2   3   Allen       sub4   3   Bran       sub3
3   4   Alice       sub6   4  Bryce       sub6
4   5  Ayoung       sub5   5  Betty       sub5